/* 
 * File:   main.cpp
 * Author: user
 *
 * 1.3. Задача «Перевёрнутые строки».
 * Входные данные: файл input.txt. Выходные данные: файл output.txt.
 * 1ая строка файла содержит текст. Длина строки не более 100000 символов.
 * Все следующие строки файла содержат текстовые ключи.
 * Для каждого текстового ключа выяснить, есть ли ключ в тексте в перевёрнутом
 * виде (без учёта символов пробела “ “, тире “-“ и слеша “\”; все заглавные
 * символы равноценны строчным). Для каждого ключа требуется выдать «YES»
 * если он содержится в тексте и «NO» если не содержится. Ответ требуется
 * дать выходной файл в том же порядке, в котором ключи расположены
 * во входном файле.
 * 
 * Created on чацвер, 17, кастрычніка 2013, 22.09
 */

#include <iostream>
#include <fstream>
#include <string>
#include <algorithm>
#include <cstdlib>

using namespace std;

/*
 * 
 */
int main(int argc, char** argv) {

    return 0;
}

